package one;

public class ConstructorBasic {
/*
	생성자(Constructor)
	생성자는 인스턴스가 생성될 때 호출되는 '인스턴스 초기화 메서드'이다.

	-생성자의 조건
	1. 생성자의 이름은 클래스의 이름과 같아야 한다.
	2. 생성자는 리턴 값이 없다.
	
	-생성자의 형식
	클래스 이름(타입 변수명, 타입 변수명, ,,,) {
		인스턴스 생성 시 수행될 코드
		주로 인스턴스 변수의 초기화 코드를 적는다.
	}

	-ex:
	Card(String k, int num);
	1. 연산자 new에 의해서 메모리(heap)에 Card 클래스의 인스턴스가 생성된다.
	2. 생성자 Card()가 호출되어 수행된다.
	3. 연산자 new의 결과로 생성된 Card 인스턴스의 구조가 반환되어 참조변수에 저장된다.
*/
/*
	기본 생성자(default constructor)
	모든 클래스에는 반드시 하나 이상의 생성자가 정의되어 있어야 한다.
	
	클래스 이름() {	
	}
	
	card() {
	}
	
	기본 생성자는 매개변수가 없는 형태이다.
	
*/	
	
	
}
