package six;

	import java.lang.invoke.*;									//얘는 자동 임포트되어있지만 한번 땡겨봄

		public class ImportBasic {

	
/*	
	import문
	
	소스코드를 작성할 때, 다른 패키지의 클래스를 사용하려면
	패키지명이 포함된 클래스 이름을 사용해야 한다.
	
	클래스의 코드를 작성하기 전에 import문으로 사용하고자 하는					//Scanner 자동완성하면 따라오는 애
	클래스의 패키지를 미리 명시해주면 소스코드에 사용되는 클래스 이름에서
	패키지명은 생략할 수 있다.
	
	이클립스 자동 임포트 단축키: 컨 + 쉽 + o								//객체지향에서 만들 때마다 써서 손이 기억하게 만들어라
	
	import문 선언
	일반적인 소스파일(*.java)의 구성은 다음의 순서로 되어있다.
	
	1. package문
	2. import문
	3. 클래스 선언문
	
	import 패키지명.클래스명;											//오직 그 클래스 하나만 불러온다
	또는
	import 패키지명.*;												//패키지명 안의 모든 클래스를 불러온다
*/	
}
