package six;

public class PackageBasic {
/*	
	패키지(package)														//현업에서는 디폴트패키지 이런 거 없다. 무조건 패키지 단위
																		//물리(하드디스크)의 영역을 알아야 됨
	패키지란, 클래스의 묶음이다.
	서로 관련된 클래드끼리 그룹 단위로 묶어 놓음으로써 클래스를 효율적으로 관리할 수 있다.
	
	클래스의 실제 이름은(full name)
	
    같은 이름의 클래스일 지라도 서로 다른 패키지에 속하면 패키지명으로 구별이 가능하다.
    - 하나의 소스파일에는 첫 번째 문장으로 단 한번의 패키지 선언만을 허용한다.
    - 모든 클래스는 반드시 하나의 패키지에 속해야 한다.
    - 점(.)을 구분하여 계층구조로 구성할 수 있다.
    - 물리적으로 클래스 파일(.class)을 포함하는 하나의 디렉토리이다.
    
 패키지 선언 : package 패키지명;
    패키지 선언문은 반드시 소스파일에 첫 번째 문장이여야 한다.
    
 **명명규칙
    -클래스명과 쉽게 구분하기 위해서 소문자로 하는 것을 원칙으로 하고 있다.
    -의미가 달라지면 .으로 구분한다(필수는 아님)
*/
}
